api/services/pedido.js

const myHeaders = new Headers();
myHeaders.append("SOAPAction", "http://ar.gov.afip.dif.FEV1/FECAESolicitar");
myHeaders.append("Content-Type", "text/xml; charset=utf-8");


const raw = " <soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:ar=\"http://ar.gov.afip.dif.FEV1/\">\r\n   <soapenv:Header/>\r\n   <soapenv:Body>\r\n       <ar:FECAESolicitar>\r\n        <!--Optional:-->\r\n         <ar:Auth>            \r\n            <ar:Token>PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiIHN0YW5kYWxvbmU9InllcyI/Pgo8c3NvIHZlcnNpb249IjIuMCI+CiAgICA8aWQgc3JjPSJDTj13c2FhaG9tbywgTz1BRklQLCBDPUFSLCBTRVJJQUxOVU1CRVI9Q1VJVCAzMzY5MzQ1MDIzOSIgZHN0PSJDTj13c2ZlLCBPPUFGSVAsIEM9QVIiIHVuaXF1ZV9pZD0iMzQ2Mjc2MzkwNSIgZ2VuX3RpbWU9IjE3NTUyOTAyNjYiIGV4cF90aW1lPSIxNzU1MzMzNTI2Ii8+CiAgICA8b3BlcmF0aW9uIHR5cGU9ImxvZ2luIiB2YWx1ZT0iZ3JhbnRlZCI+CiAgICAgICAgPGxvZ2luIGVudGl0eT0iMzM2OTM0NTAyMzkiIHNlcnZpY2U9IndzZmUiIHVpZD0iU0VSSUFMTlVNQkVSPUNVSVQgMjAyOTI2MTU4MzQsIENOPWNvcnJhZmVyIiBhdXRobWV0aG9kPSJjbXMiIHJlZ21ldGhvZD0iMjIiPgogICAgICAgICAgICA8cmVsYXRpb25zPgogICAgICAgICAgICAgICAgPHJlbGF0aW9uIGtleT0iMjAyOTI2MTU4MzQiIHJlbHR5cGU9IjQiLz4KICAgICAgICAgICAgPC9yZWxhdGlvbnM+CiAgICAgICAgPC9sb2dpbj4KICAgIDwvb3BlcmF0aW9uPgo8L3Nzbz4K</ar:Token>            \r\n            <ar:Sign>RKtikAH4zZ+UpsraDxVsN0qhhDHljvz948irx7qHETFWoo3cM7gBtS0o+oZiRl7Gh2WQd2VOePvVZs8Ub/3A2mHwkSOO0WaMpz/8ilVkBKf4jtADE9pnOqar0B4e1y3d2YhIx9fdigf2fGTyGwi/+hlmVF4+TUNu+UKzDJYxkoc=</ar:Sign>\r\n            <ar:Cuit>20292615834</ar:Cuit>\r\n         </ar:Auth> \r\n         <ar:FeCAEReq>            \r\n            <ar:FeCabReq>\r\n               <ar:CantReg>1</ar:CantReg>\r\n               <ar:PtoVta>12</ar:PtoVta>  \r\n               <ar:CbteTipo>1</ar:CbteTipo> \r\n            </ar:FeCabReq>\r\n            <ar:FeDetReq>               \r\n             <ar:FECAEDetRequest>\r\n                  <ar:Concepto>1</ar:Concepto>\r\n                  <ar:DocTipo>80</ar:DocTipo>\r\n                  <ar:DocNro>20111111112</ar:DocNro>\r\n                  <ar:CbteDesde>3</ar:CbteDesde>\r\n                  <ar:CbteHasta>3</ar:CbteHasta>                  \r\n                  <ar:CbteFch>20250815</ar:CbteFch>\r\n                  <ar:ImpTotal>184.05</ar:ImpTotal>    \r\n                  <ar:ImpTotConc>0</ar:ImpTotConc>\r\n                  <ar:ImpNeto>150</ar:ImpNeto> \r\n                  <ar:ImpOpEx>0</ar:ImpOpEx>\r\n                  <ar:ImpTrib>7.8</ar:ImpTrib>\r\n                  <ar:ImpIVA>26.25</ar:ImpIVA>\r\n                  <ar:FchServDesde></ar:FchServDesde>      <ar:FchServHasta></ar:FchServHasta>                 \r\n                  <ar:FchVtoPago></ar:FchVtoPago>                  \r\n                  <ar:MonId>PES</ar:MonId>\r\n                  <ar:MonCotiz>1</ar:MonCotiz>\r\n                  <ar:CondicionIVAReceptorId>1</ar:CondicionIVAReceptorId>\r\n                  <ar:Tributos>                     \r\n                     <ar:Tributo>\r\n                        <ar:Id>99</ar:Id>   \r\n                        <ar:Desc>Impuesto Municipal Matanza</ar:Desc>\r\n                        <ar:BaseImp>150</ar:BaseImp>\r\n                        <ar:Alic>5.2</ar:Alic>\r\n                        <ar:Importe>7.8</ar:Importe>\r\n                     </ar:Tributo>\r\n                  </ar:Tributos>                  \r\n                  <ar:Iva>\r\n                     <ar:AlicIva>\r\n                        <ar:Id>5</ar:Id> \r\n                        <ar:BaseImp>100</ar:BaseImp>\r\n                        <ar:Importe>21</ar:Importe>\r\n                     </ar:AlicIva>\r\n                     <ar:AlicIva>\r\n                        <ar:Id>4</ar:Id> \r\n                        <ar:BaseImp>50</ar:BaseImp>\r\n                        <ar:Importe>5.25</ar:Importe>\r\n                     </ar:AlicIva>\r\n                  </ar:Iva> \r\n</ar:FECAEDetRequest>\r\n            </ar:FeDetReq>\r\n         </ar:FeCAEReq>\r\n      </ar:FECAESolicitar>\r\n   </soapenv:Body>\r\n </soapenv:Envelope>              ";

const requestOptions = {
  method: "POST",
  headers: myHeaders,
  body: raw,
  redirect: "follow"
};

fetch("https://wswhomo.afip.gov.ar/wsfev1/service.asmx", requestOptions)
  .then((response) => response.text())
  .then((result) => console.log(result))
  .catch((error) => console.error(error));